wintersmith/contents/articles/Java/2015-03-04-Thread.html
---
date: 2015-03-04 11:28:01
template: tech.jade
title: Java Thread 状态和stack dump分析
category: Java
chage_frequency: monthly
tag: Java
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Thread 对象</a></li>
<li><a href="#sec-2">Thread 状态</a></li>
<li><a href="#sec-3">Thread 操作</a></li>
<li><a href="#sec-4">Thread stack dump</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Thread 对象</h2>
<div class="outline-text-2" id="text-1">
<dl class="org-dl">
<dt> stack size </dt><dd>如果未设置，取jvm默认值 256k，可以通过参数 -Xss 配置。
</dd>
<dt> classLoader </dt><dd>ContextClassLoader 继承父类。
</dd>
<dt> state </dt><dd>线程状态起初时候NEW，直到最后的TERMINATE。
</dd>
<dt> tid </dt><dd>线程Id，这个id与系统/native进程有关系，一般是进制不同，值相同。
</dd>
<dt> sequenceNum </dt><dd>线程序号，默认的线程名是：Thread-sequenceNum
</dd>
<dt> priority </dt><dd>优先级，继承父类：0 － 10
</dd>
<dt> blocker </dt><dd>interruptible对象，如果调用了blockOn的操作阻塞在一个可中断的对象（interruptible）上面，则在线程被中断的时候，这个interruptible的对象会被中断通知到——调用其interrupt方法。
</dd>
<dt> parkBlocker </dt><dd>这个字段供LockSupport使用，保存Blocker的对象。
</dd>
<dt> ThreadLoclMap </dt><dd>供ThreadLocal使用的ThreadLoclMap
</dd>
<dt> deamon </dt><dd>是否是后台线程，默认否。后台线程在JVM退出的时候自动杀掉，jvm退出时候，如果有非后台线程，它就不退出。
</dd>
<dt> target </dt><dd>runable 对象，要执行的过程。
</dd>
<dt> group </dt><dd>线程的线程组，继承父线程。
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Thread 状态</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-java">public enum State {
    /**
     * Thread state for a thread which has not yet started.
     */
    NEW,

    /**
     * Thread state for a runnable thread.  A thread in the runnable
     * state is executing in the Java virtual machine but it may
     * be waiting for other resources from the operating system
     * such as processor.
     */
    RUNNABLE,

    /**
     * Thread state for a thread blocked waiting for a monitor lock.
     * A thread in the blocked state is waiting for a monitor lock
     * to enter a synchronized block/method or
     * reenter a synchronized block/method after calling
     * {@link Object#wait() Object.wait}.
     */
    BLOCKED,

    /**
     * Thread state for a waiting thread.
     * A thread is in the waiting state due to calling one of the
     * following methods:
     * &lt;ul&gt;
     *   &lt;li&gt;{@link Object#wait() Object.wait} with no timeout&lt;/li&gt;
     *   &lt;li&gt;{@link #join() Thread.join} with no timeout&lt;/li&gt;
     *   &lt;li&gt;{@link LockSupport#park() LockSupport.park}&lt;/li&gt;
     * &lt;/ul&gt;
     *
     * &lt;p&gt;A thread in the waiting state is waiting for another thread to
     * perform a particular action.
     *
     * For example, a thread that has called &lt;tt&gt;Object.wait()&lt;/tt&gt;
     * on an object is waiting for another thread to call
     * &lt;tt&gt;Object.notify()&lt;/tt&gt; or &lt;tt&gt;Object.notifyAll()&lt;/tt&gt; on
     * that object. A thread that has called &lt;tt&gt;Thread.join()&lt;/tt&gt;
     * is waiting for a specified thread to terminate.
     */
    WAITING,

    /**
     * Thread state for a waiting thread with a specified waiting time.
     * A thread is in the timed waiting state due to calling one of
     * the following methods with a specified positive waiting time:
     * &lt;ul&gt;
     *   &lt;li&gt;{@link #sleep Thread.sleep}&lt;/li&gt;
     *   &lt;li&gt;{@link Object#wait(long) Object.wait} with timeout&lt;/li&gt;
     *   &lt;li&gt;{@link #join(long) Thread.join} with timeout&lt;/li&gt;
     *   &lt;li&gt;{@link LockSupport#parkNanos LockSupport.parkNanos}&lt;/li&gt;
     *   &lt;li&gt;{@link LockSupport#parkUntil LockSupport.parkUntil}&lt;/li&gt;
     * &lt;/ul&gt;
     */
    TIMED_WAITING,

    /**
     * Thread state for a terminated thread.
     * The thread has completed execution.
     */
    TERMINATED;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Thread 操作</h2>
<div class="outline-text-2" id="text-3">
<dl class="org-dl">
<dt> start() </dt><dd>启动线程，NEW －&gt; RUNABLE
</dd>
<dt> sleep(..) </dt><dd>休息，但是不释放拥有的对象锁——如果在同步区
</dd>
<dt> yield() </dt><dd>主动放弃执行，提示调度器执行一次调度
</dd>
<dt> join(..)  </dt><dd>等待线程的执行结束
</dd>
<dt> Object.wait(..) </dt><dd>将当前线程暂停，进入 <code>WAITING</code> 状态或者 <code>TIMED\_WAITING</code> 同时释放掉获取的 monitor, 其它线程通过 <code>Object.notify</code> 或者 <code>Object.notifyAll</code> 来wakeup 它
</dd>
<dt> synchronized(..) </dt><dd>等待对象 monitor而暂停，进入 <code>BLOCKED</code> 状态，在monitor可获取且获取成功后进入 <code>RUNABLE</code>
</dd>
<dt> LockSupport.park(..) </dt><dd>进入暂停状态， <code>WAITING</code> 或者 <code>TIMED\_WAITING</code> 在被其它线程 <code>LockSupport.unpark</code> 后进入 <code>RUNABLE</code>
</dd>
<dt> isAlive() </dt><dd>判断是否已经启动且未结束
</dd>
<dt> interrupted() </dt><dd>探测是否设置了interrupted标志，并清除它
</dd>
<dt> isInterrupted() </dt><dd>探测interrupted标志，但不清除
</dd>
<dt> interrupt() </dt><dd>中断线程，如果线程之前设置了 <code>Thread.blocker</code> 则 这个blocker会被 blocker.interrupt 到:
</dd>
</dl>
<div class="org-src-container">

<pre class="src src-java">* &lt;p&gt; If this thread is blocked in an invocation of the {@link
* Object#wait() wait()}, {@link Object#wait(long) wait(long)}, or {@link
* Object#wait(long, int) wait(long, int)} methods of the {@link Object}
* class, or of the {@link #join()}, {@link #join(long)}, {@link
* #join(long, int)}, {@link #sleep(long)}, or {@link #sleep(long, int)},
* methods of this class, then its interrupt status will be cleared and it
* will receive an {@link InterruptedException}.
*
* &lt;p&gt; If this thread is blocked in an I/O operation upon an {@link
* java.nio.channels.InterruptibleChannel &lt;/code&gt;interruptible
* channel&lt;code&gt;} then the channel will be closed, the thread's interrupt
* status will be set, and the thread will receive a {@link
* java.nio.channels.ClosedByInterruptException}.
*
* &lt;p&gt; If this thread is blocked in a {@link java.nio.channels.Selector}
* then the thread's interrupt status will be set and it will return
* immediately from the selection operation, possibly with a non-zero
* value, just as if the selector's {@link
* java.nio.channels.Selector#wakeup wakeup} method were invoked.
*
* &lt;p&gt; If none of the previous conditions hold then this thread's interrupt
* status will be set. &lt;/p&gt;
*
* &lt;p&gt; Interrupting a thread that is not alive need not have any effect.
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Thread stack dump</h2>
<div class="outline-text-2" id="text-4">
<p>
jstack -l 可以获取Jvm线程的stackTrace列表，其中列出了线程的状态，我们可以参照上面的线程状态，知道线程在干什么，判断死锁和竞争等情况。
</p>

<p>
获得stack dump的方法很多，比如 <code>e.printStackTrace</code> , <code>Thread.dumpStack</code> , <code>Thread.currentThread().getStackTrace</code> 等， 可以在Thread类中找到它们。
</p>

<p>
此外System类中也有方法支持。
</p>
</div>
</div>
